app/controllers/api/v1/flight_details_controller.rb

  def index
    flight_details = FlightDetail.all
---
SELECT "flight_details".* FROM "flight_details"

  def show
    flight_detail = FlightDetail.find(params[:id])
---
SELECT "flight_details".* FROM "flight_details" WHERE "flight_details"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    flight_detail = FlightDetail.new(flight_detail_params)
    if flight_detail.save
---
INSERT INTO "flight_details" ("first_name", "last_name", "pnr", "fare_class", "travel_date", "pax", "ticketing_date", "email", "mobile_phone", "booked_cabin", "discount_code", "created_at", "updated_at", "error_messages") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

  def update
    flight_detail = FlightDetail.find(params[:id])
    if flight_detail.update(flight_detail_params)
---
SELECT "flight_details".* FROM "flight_details" WHERE "flight_details"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "flight_details" SET "ticketing_date" = $1, "updated_at" = $2 WHERE "flight_details"."id" = $3  [["ticketing_date", "2023-04-28"], ["updated_at", "2023-04-30 17:12:13.584099"], ["id", 6]]

  def destroy
    flight_detail = FlightDetail.find(params[:id])
    flight_detail.destroy
---
SELECT "flight_details".* FROM "flight_details" WHERE "flight_details"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "flight_details" WHERE "flight_details"."id" = $1  [["id", 3]]

  def upload
    file = params[:file]
    if file.present?
      # Parse the CSV file and create flight details
      flight_details = []
      FlightDetail.transaction do
        CSV.foreach(file.path, headers: true) do |row|
          flight_detail = FlightDetail.create(row.to_hash)
          flight_details << flight_detail
---
INSERT INTO "flight_details" ("first_name", "last_name", "pnr", "fare_class", "travel_date", "pax", "ticketing_date", "email", "mobile_phone", "booked_cabin", "discount_code", "created_at", "updated_at", "error_messages") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"